
*     
*** UI  
***** scroll
******* DONE derive from uki scroll pane [3/3]
        SCHEDULED: <2011-02-19 Sat 11:35>
        CLOCK: [2011-02-19 Sat 19:02]--[2011-02-19 Sat 20:31] =>  1:29
        :PROPERTIES:
        :Effort:   4:00
        :Clockhistory: 3
        | :Clock1: | [2011-02-19 Sat 11:37]--[2011-02-19 Sat 14:22] =>  2:45 | easy method impossible |
        | :Clock2: | [2011-02-19 Sat 14:25]--[2011-02-19 Sat 16:00] =>  1:35 | can not set right w/h  |
        | :Clock3: | [2011-02-19 Sat 18:03]--[2011-02-19 Sat 18:22] =>  0:19 | root cause             |
        :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "derive_from_uki_scroll_pane")
        :END:
        - [X] dev.js
        - [X] make_scroller 
              (link "~/local/src/baza/public/javascripts/lib.scroll.js" 8360)
              there is no easy way, need deep merge the two
        - [X] width setting
******* HALT fix bug for home app
******* tab include different tab
******* orientation compatible
***** component
******* button tab
********* DONE uki solution [2/2]
          SCHEDULED: <2011-02-19 Sat 15:50>
          CLOCK: [2011-02-19 Sat 20:33]--[2011-02-19 Sat 20:56] =>  0:23
          :PROPERTIES:
          :Effort:   1:00
          :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "uki_solution")
          :END:
          - [X] plain segment button layout
          - [X] scroll pane view switch function
********* jquerytools solution
******* chart view
********* DONE solution search
          - zingchart is beautiful, but do not need almost feature
            http://www.zingchart.com 
          - google chart maybe more stable, just return rendered image
            http://code.google.com/apis/ajax/playground/?type=visualization#pie_chart
          - jquery visualize plugin looks plain and use html table
            http://www.filamentgroup.com/dwpe/#codeexamples
          - jqplot, plain
            http://www.jqplot.com/tests/highlighterTests.php
          - highchart export/print support is nice, seems very fast
            (though SVG)
            http://www.highcharts.com/demo/?example=area-inverted&theme=gray
            it's code is best
********* build
*********** DONE build block [5/7]
            SCHEDULED: <2011-02-19 Sat 17:05>
            CLOCK: [2011-02-19 Sat 21:00]--[2011-02-19 Sat 22:21] =>  1:21
            :PROPERTIES:
            :Effort:   2:30
            :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "build_block")
            :END:
            - [X] stand out font
                  3.2 has bug, use strokeText
            - [X] mark font
            - [X] color scheme
            - [X] shadow
            - [X] transparent
            - [ ] overlay
            - [ ] jumper
*********** TODO layout [2/4]
            SCHEDULED: <2011-02-19 Sat 19:50>
            :PROPERTIES:
            :Effort:   3:00
            :Clockhistory: 2
            | :Clock1: | [2011-02-20 Sun 09:41]--[2011-02-20 Sun 13:03] =>  3:22 | init  |
            | :Clock2: | [2011-02-20 Sun 16:03]--[2011-02-20 Sun 20:57] =>  4:54 | break |
            :END:
            - [X] day
                - stand out number
                - date
                - hour mark
                - color array
                - task overlay
            - [X] multiple canvas in scroll pane
            - [ ] week
                - stand out number
                - day mark
                - day jumper
            - [ ] month
                - stand out number
                - week mark
                - week jumper
*********** ABORT try highchart
*********** TODO json -> canvas code [1/2]
            SCHEDULED: <2011-02-20 Sun 02:15>
            :PROPERTIES:
            :Effort:   1:00
            :END:
            - [ ] var
            - [X] ajax
                  if build all into one huge html, this is unnecessary 
******* DONE font

        - at least iphone4 do not support HTML5 font feature
          can refer http://ballotbucks.org/
        - finally use strokeText
        
*** Exporter
***** TODO org -> json/sheet [0/4]
      SCHEDULED: <2011-02-20 Sun 03:30>
      :PROPERTIES:
      :Effort:   5:00
      :END:
      - [ ] agenda how to
      - [ ] single file exporter
      - [ ] multiple file exporter
      - [ ] save hook
***** TODO json/sheet diff -> notification message  [0/7]
      SCHEDULED: <2011-02-20 Sun 08:45>
      :PROPERTIES:
      :Effort:   5:00
      :END:
      - [ ] server.rb
      - [ ] compare Object
      - [ ] message generator
      - [ ] git push function
      - [ ] notify function
      - [ ] hook git push
      - [ ] hook notifo
*** DONE Notify
    it works from beginning
